СистемаЛиквидацииАкадемическихЗадолженностей/src/Documents/ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей/ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</name>
  <basedOn>Document.НаправлениеНаПересдачу</basedOn>
  <registerRecords>AccumulationRegister.НагрузкаКомиссий</registerRecords>
  <registerRecords>AccumulationRegister.НеявкиНаПересдачи</registerRecords>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныеГода</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>CatalogRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПреподавательКомиссии</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </attributes>
  <attributes>
    <name>РольВКомиссии</name>
    <type>
      <types>EnumRef.РольВКомиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасыРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.НаправлениеНаПересдачу</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НазначениеСтудентаДляПреподавателя</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.Студенты</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеВида</name>
      <type>
        <types>EnumRef.НаименованиеВида</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПропусков</name>
      <type>
        <types>EnumRef.КоличествоПропусков</types>
      </type>
    </attributes>
    <attributes>
      <name>ПотерянныеЧасыПреподавателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

СистемаЛиквидацииАкадемическихЗадолженностей/src/Documents/НаправлениеНаПересдачу/НаправлениеНаПересдачу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НаправлениеНаПересдачу</name>
  <basedOn>Document.УведомлениеОНаличииЗадолженности</basedOn>
  <registerRecords>InformationRegister.ГрафикПересдач</registerRecords>
  <registerRecords>CalculationRegister.РасчетНагрузкиПреподавателейПоПересдачам</registerRecords>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормаОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПересдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аудитория</name>
    <type>
      <types>CatalogRef.Аудитории</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаКонтроля</name>
    <type>
      <types>EnumRef.НаименованиеКонтроля</types>
    </type>
  </attributes>
</mdclass:Document>

СистемаЛиквидацииАкадемическихЗадолженностей/src/Documents/ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция НазначениеСтудентаДляПреподавателяКоличествоПропусковПриИзмененииНаСервере(Значение)
	Если Значение = Перечисления.КоличествоПропусков.Ноль Тогда
		Возврат "-";
	ИначеЕсли Значение = Перечисления.КоличествоПропусков.Один Тогда
		Возврат 2;
	ИначеЕсли Значение = Перечисления.КоличествоПропусков.Два Тогда
		Возврат 4;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура НазначениеСтудентаДляПреподавателяКоличествоПропусковПриИзменении(Элемент)  
	ТЧ = Элементы.НазначениеСтудентаДляПреподавателя.ТекущиеДанные;
	Значение = ТЧ.КоличествоПропусков;
	ТЧ.ПотерянныеЧасыПреподавателя = НазначениеСтудентаДляПреподавателяКоличествоПропусковПриИзмененииНаСервере(Значение);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	    ДисциплинаОснование = Объект.ДокументОснование.Дисциплина;
	ПреподавательОснование = Объект.ДокументОснование.Преподаватель;
	ФакультетОснование = Объект.ДокументОснование.Факультет;
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НаправлениеНаПересдачу.Студент КАК Студент
		|ИЗ
		|	Документ.НаправлениеНаПересдачу КАК НаправлениеНаПересдачу
		|ГДЕ
		|	НаправлениеНаПересдачу.Дисциплина = &ДисциплинаОснование
		|	И НаправлениеНаПересдачу.Преподаватель = &ПреподавательОснование
		|	И НаправлениеНаПересдачу.Факультет = &ФакультетОснование";
	
	Запрос.УстановитьПараметр("ДисциплинаОснование", ДисциплинаОснование);
	Запрос.УстановитьПараметр("ПреподавательОснование", ПреподавательОснование);
	Запрос.УстановитьПараметр("ФакультетОснование", ФакультетОснование);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	ТаблицаСтудентов = РезультатЗапроса.Выгрузить();
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтр = Объект.НазначениеСтудентаДляПреподавателя.Добавить();
		НоваяСтр.Студент = ВыборкаДетальныеЗаписи.Студент;  
		
	КонецЦикла;

КонецПроцедуры
